wang521258/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32s3"
# 正点原子 DN-ESP32-S3-BOX3:ESP32-S3,octal PSRAM 8MB / 80MHz,Flash 8MB QIO。

# --- PSRAM(octal) ---
# S3 板载 8MB octal PSRAM @ 80MHz(板子启动日志实测)。不开 PSRAM 大缓冲/LVGL 会崩。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_OCT=y
CONFIG_SPIRAM_TYPE="oct"
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_OCTAL_PSRAM_FIXED_SIZE=y
CONFIG_SPIRAM_OCTAL_PSRAM_80M_SPEED=y

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头,关闭 detect,便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# box3 Flash 为 QIO(板子启动日志实测 "flash 8MB QIO")。
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000,二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键(BOOT/GPIO0)5 秒,由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:UART0 默认引脚(GPIO43/44)→ 板载 CH343/COM3 ---
# 真机用 USB-UART(CH343)看日志,走 UART0 默认引脚即可
# (QEMU 那版改 GPIO21/20 仅用于模拟器,刷真机必须改回默认)。
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 调试:崩溃时打印调用栈再重启,便于定位问题 ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# cn_16 子集字库由 lv_font_conv 生成,glyph 位图是 RLE 压缩格式(bitmap_format=1)。
# 此开关必须打开,否则中文全部不显示。
CONFIG_LV_USE_FONT_COMPRESSED=y
# LVGL 内置 malloc 池(KB)。宠物页 65+ 对象 + canvas + 面板,提到 48KB 才稳。
CONFIG_LV_MEM_SIZE_KILOBYTES=48

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-S3 支持 BLE;示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
